In [10]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm
import scipy as sp
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
labtat = pd.read_csv("C:\\datascienceclass\\LabTAT.csv")

In [12]:
labtat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [17]:
labtat.head(150)

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

In [18]:
labtat.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [19]:
# The Null and Alternative Hypothesis

#There are no significant differences between the groups' mean Lab values. H0:μ1=μ2=μ3=μ4=μ5

#There is a significant difference between the groups' mean Lab values. Ha:μ1≠μ2≠μ3≠μ4

In [56]:
l1 = labtat.iloc[:,0]
l1

0      185.35
1      170.49
2      192.77
3      177.33
4      193.41
        ...
115    178.49
116    176.08
117    202.48
118    182.40
119    182.09
Name: Laboratory 1, Length: 120, dtype: float64

In [29]:
l2 = labtat.iloc[:,1]
l2

0      165.53
1      185.91
2      194.92
3      183.00
4      169.57
        ...
115    170.66
116    183.98
117    174.54
118    197.18
119    215.17
Name: Laboratory 2, Length: 120, dtype: float64

In [31]:
l3 = labtat.iloc[:,2]
l3

0      176.70
1      198.45
2      201.23
3      199.61
4      204.63
        ...
115    193.80
116    215.25
117    203.99
118    194.52
119    221.49
Name: Laboratory 3, Length: 120, dtype: float64

In [54]:
l4 = labtat.iloc[:,3]
l4

0      166.13
1      160.79
2      185.18
3      176.42
4      152.60
        ...
115    172.68
116    177.64
117    170.27
118    150.87
119    162.21
Name: Laboratory 4, Length: 120, dtype: float64

In [58]:
tStat, pvalue = sp.stats.f_oneway(l1,l2,l3,l4)
print("P-Value:{0} T-Statistic:{1}".format(pvalue,tStat))

P-Value:2.1156708949992414e-57 T-Statistic:118.70421654401437

tStat,p_value =sp.stats.f_oneway(l1,l2,l3,l4)

print("p-value:{5} T-statistic:{1}".format(p_value,tStat))

In [49]:
tStat

118.70421654401437

In [50]:
if p_value < 0.05:
    print("we reject  null hypothesis")
else:
    print("we accept null hypothesis")

we reject  null hypothesis